Revit 2027 API
BuiltInFailures.FamilyFailures.CannotCopyByPatternFamilies Property
 Can't copy between Mass or Curtain Panel by Pattern families, and other families or Revit projects.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCopyByPatternFamilies { get; }
Public Shared ReadOnly Property CannotCopyByPatternFamilies As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCopyByPatternFamilies {
	FailureDefinitionId^ get ();
}
static member CannotCopyByPatternFamilies : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace